app/controllers/clients_controller.rb

  def change_stage
    @client = Client.find(params[:id])
    @client.state += 1
    @client.first_contact = Date.today
    if @client.save
---
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "clients" SET "state" = ?, "first_contact" = ?, "updated_at" = ? WHERE "clients"."id" = ?  [["state", 2], ["first_contact", "2017-09-10"], ["updated_at", "2017-09-11 00:05:16.409044"], ["id", 4]]

  def create
    @client = Client.new(client_params)

    if @client.save
---
INSERT INTO "clients" ("name", "email", "address", "phone", "detail", "state", "reserve", "birthday", "first_contact", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if @client.update(client_params)
---
UPDATE "clients" SET "first_contact" = ?, "updated_at" = ? WHERE "clients"."id" = ?  [["first_contact", "2017-09-08"], ["updated_at", "2017-09-10 23:25:20.807430"], ["id", 1]]